; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p10---int100n150-m25---int100c110---s362---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level10 level59)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level10 level60)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level50 level24 level74)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level10 level61)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level51 level24 level75)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level10 level62)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level52 level24 level76)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level10 level63)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level53 level24 level77)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level10 level64)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level54 level24 level78)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level10 level65)
(sum level55 level18 level73)
(sum level55 level20 level75)
(sum level55 level24 level79)
(sum level56 level2 level58)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level10 level66)
(sum level56 level18 level74)
(sum level56 level20 level76)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level10 level67)
(sum level57 level18 level75)
(sum level57 level20 level77)
(sum level57 level24 level81)
(sum level58 level2 level60)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level10 level68)
(sum level58 level18 level76)
(sum level58 level20 level78)
(sum level58 level24 level82)
(sum level59 level2 level61)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level10 level69)
(sum level59 level18 level77)
(sum level59 level20 level79)
(sum level59 level24 level83)
(sum level60 level2 level62)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level10 level70)
(sum level60 level18 level78)
(sum level60 level20 level80)
(sum level60 level24 level84)
(sum level61 level2 level63)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level10 level71)
(sum level61 level18 level79)
(sum level61 level20 level81)
(sum level61 level24 level85)
(sum level62 level2 level64)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level10 level72)
(sum level62 level18 level80)
(sum level62 level20 level82)
(sum level62 level24 level86)
(sum level63 level2 level65)
(sum level63 level4 level67)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level10 level73)
(sum level63 level18 level81)
(sum level63 level20 level83)
(sum level63 level24 level87)
(sum level64 level2 level66)
(sum level64 level4 level68)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level10 level74)
(sum level64 level18 level82)
(sum level64 level20 level84)
(sum level64 level24 level88)
(sum level65 level2 level67)
(sum level65 level4 level69)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level10 level75)
(sum level65 level18 level83)
(sum level65 level20 level85)
(sum level66 level2 level68)
(sum level66 level4 level70)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level10 level76)
(sum level66 level18 level84)
(sum level66 level20 level86)
(sum level67 level2 level69)
(sum level67 level4 level71)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level10 level77)
(sum level67 level18 level85)
(sum level67 level20 level87)
(sum level68 level2 level70)
(sum level68 level4 level72)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level10 level78)
(sum level68 level18 level86)
(sum level68 level20 level88)
(sum level69 level2 level71)
(sum level69 level4 level73)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level10 level79)
(sum level69 level18 level87)
(sum level70 level2 level72)
(sum level70 level4 level74)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level10 level80)
(sum level70 level18 level88)
(sum level71 level2 level73)
(sum level71 level4 level75)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level10 level81)
(sum level72 level2 level74)
(sum level72 level4 level76)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level10 level82)
(sum level73 level2 level75)
(sum level73 level4 level77)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level10 level83)
(sum level74 level2 level76)
(sum level74 level4 level78)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level10 level84)
(sum level75 level2 level77)
(sum level75 level4 level79)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level10 level85)
(sum level76 level2 level78)
(sum level76 level4 level80)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level10 level86)
(sum level77 level2 level79)
(sum level77 level4 level81)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level10 level87)
(sum level78 level2 level80)
(sum level78 level4 level82)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level10 level88)
(sum level79 level2 level81)
(sum level79 level4 level83)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level80 level2 level82)
(sum level80 level4 level84)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level81 level2 level83)
(sum level81 level4 level85)
(sum level81 level6 level87)
(sum level82 level2 level84)
(sum level82 level4 level86)
(sum level82 level6 level88)
(sum level83 level2 level85)
(sum level83 level4 level87)
(sum level84 level2 level86)
(sum level84 level4 level88)
(sum level85 level2 level87)
(sum level86 level2 level88)

(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l1 l4)
(fuelcost level8 l1 l4)
(connected l1 l5)
(fuelcost level2 l1 l5)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l5)
(fuelcost level6 l2 l5)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l5)
(fuelcost level20 l3 l5)
(connected l3 l6)
(fuelcost level4 l3 l6)
(connected l4 l1)
(fuelcost level8 l4 l1)
(connected l4 l6)
(fuelcost level24 l4 l6)
(connected l5 l1)
(fuelcost level2 l5 l1)
(connected l5 l2)
(fuelcost level6 l5 l2)
(connected l5 l3)
(fuelcost level20 l5 l3)
(connected l5 l6)
(fuelcost level10 l5 l6)
(connected l6 l3)
(fuelcost level4 l6 l3)
(connected l6 l4)
(fuelcost level24 l6 l4)
(connected l6 l5)
(fuelcost level10 l6 l5)

(at t0 l1)
(fuel t0 level88)
(= (total-cost) 0)

(at p0 l1)
(at p1 l6)
(at p2 l0)
(at p3 l3)
(at p4 l2)
(at p5 l3)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l0)
)

(:goal
(and
(at p0 l6)
(at p1 l1)
(at p2 l2)
(at p3 l6)
(at p4 l6)
(at p5 l6)
(at p6 l5)
(at p7 l2)
(at p8 l6)
(at p9 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 10
2. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 10
3. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 10
4. (drive t0 l1 l2 level78 level10 level88)
   deleted: (at t0 l1) (fuel t0 level88)
   added: (at t0 l2) (fuel t0 level78)
   goals met: 0 of 10
5. (drive t0 l2 l0 level60 level18 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l0) (fuel t0 level60)
   goals met: 0 of 10
6. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 10
7. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 10
8. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 10
9. (drive t0 l0 l2 level42 level18 level60)
   deleted: (at t0 l0) (fuel t0 level60)
   added: (at t0 l2) (fuel t0 level42)
   goals met: 0 of 10
10. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 10
11. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 2 of 10
12. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 10
13. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 3 of 10
14. (drive t0 l2 l5 level36 level6 level42)
   deleted: (at t0 l2) (fuel t0 level42)
   added: (at t0 l5) (fuel t0 level36)
   goals met: 3 of 10
15. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 4 of 10
16. (drive t0 l5 l3 level16 level20 level36)
   deleted: (at t0 l5) (fuel t0 level36)
   added: (at t0 l3) (fuel t0 level16)
   goals met: 4 of 10
17. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 4 of 10
18. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 4 of 10
19. (drive t0 l3 l6 level12 level4 level16)
   deleted: (at t0 l3) (fuel t0 level16)
   added: (at t0 l6) (fuel t0 level12)
   goals met: 4 of 10
20. (load p1 t0 l6)
   deleted: (at p1 l6)
   added: (in p1 t0)
   goals met: 4 of 10
21. (unload p0 t0 l6)
   deleted: (in p0 t0)
   added: (at p0 l6)
   goals met: 5 of 10
22. (unload p3 t0 l6)
   deleted: (in p3 t0)
   added: (at p3 l6)
   goals met: 6 of 10
23. (unload p4 t0 l6)
   deleted: (in p4 t0)
   added: (at p4 l6)
   goals met: 7 of 10
24. (unload p5 t0 l6)
   deleted: (in p5 t0)
   added: (at p5 l6)
   goals met: 8 of 10
25. (unload p8 t0 l6)
   deleted: (in p8 t0)
   added: (at p8 l6)
   goals met: 9 of 10
26. (drive t0 l6 l5 level2 level10 level12)
   deleted: (at t0 l6) (fuel t0 level12)
   added: (at t0 l5) (fuel t0 level2)
   goals met: 9 of 10
27. (drive t0 l5 l1 level0 level2 level2)
   deleted: (at t0 l5) (fuel t0 level2)
   added: (at t0 l1) (fuel t0 level0)
   goals met: 9 of 10
28. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 10 of 10
